package lesson2;

public class HomeWorkLoops {

	public static void main(String[] args) {
		/*
		 * Loops
		 * 
		 * 1. Створіть програму, що виводить на екран всі чотиризначні числа
		 * послідовності 1000 1003 1006 1009 1012 1015.
		 */
		for (int i = 1000; i <= 1015; i = i + 3) {
			System.out.println(i);
		}
		/*
		 * 2. Створіть програму, що виводить на екран перші 55 елементів
		 * послідовності 1 3 5 7 9 11 13 15 17 ....
		 */
		int j = 1;
		for (int i = 1; i <= 55; i++) {
			System.out.println(j);
			j = j + 2;
		}
		/*
		 * 3. Створіть програму, що виводить на екран всі невід'ємні елементи
		 * послідовності 90 85 80 75 70 65 60 ....
		 */
		for (int i = 90; i >= 0; i = i - 5) {
			System.out.println(i);
		}
		/*
		 * 4. Створіть програму, що виводить на екран перші 20 елементів
		 * послідовності 2 4 8 16 32 64 128 ....
		 */
		int c = 2;
		for (int i = 1; i <= 20; i++) {
			System.out.println(c);
			c = c * 2;
		}
		/*
		 * 5. Виведіть на екран всі числа в послідовності 2a-1, де a1 = 2, які
		 * менше 10000.
		 */
		for (int a = 2; a < 1000; a = 2 * a - 1) {
			System.out.println(a);
		}
		/*
		 * 6. Виведіть на екран всі двозначні члени послідовності 2a+200, де a1
		 * = -166
		 */
		for (int a = -166; a <= 100; a = 2 * a + 200) {
			if (a <= -10 || a >= 10) {
				System.out.println(a);
			}
		}
		/*
		 * 7. Створіть програму, яка обчислює факторіал натурального числа n,
		 * яке користувач введе з клавіатури.
		 */
		int f = 8;
		for (int i = 8; i >= 1; i--) {
			System.out.println(f);
			f = f * i;
		}
		/*
		 * 8. Виведіть на екран всі позитивні подільники натурального числа,
		 * введеного користувачем з клавіатури.
		 */
		int x=15;
		for(int i=x;i>0;i--){
			int b=x%i;
			if(b==0){
				System.out.println(i);
			}
		}

	}

}
